{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
            "Hi",
            "Hii",
            "Hey",
            "How are you",
            "Is anyone there?",
            "Hello",
            "Good day"
        ],
        "responses": [
            "Hey :-)",
            "Hola",
            "Hello, thanks for visiting",
            "Hi there, what can I do for you?",
            "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "allergies",
        "patterns": [
            "My Left Eye itching! What to do?",
            "My Right Eye itching! What to do?",
            "My nose is stuffy",
            "I am sneezing a lot",
            "My nose and throat is itchy",
            "skin rashes",
            "My hand are swelling and tingling"
        ],
        "responses": [
          "This can be a Symptom of Allergies Please Go to the Doctor",
          "This can be a Symptom of Allergies Please Be Care full while Travling avoid Dusty Places",
          "This can be a Symptom of Allergies Please Consider Doctors Opinion before taking any Medicine:(Antihistamines, Decongestants, corticosteroid, Allergy shots)"
        ]
      },
      {
        "tag": "coldflu",
        "patterns": [
            " i have fever",
            " i have cold",
            " i have  Cough",
            " i Feel Fatigue",
            " i have Sore Throat"
        ],
        "responses": [
            "This can be a Symptom of Cold or Flu Please Go to the Doctor",
            "This can be a Symptom of Cold or Flu Take more Rest and Avoid exercise until Symptoms are gone",
            "This can be a Symptom of Cold or Flu Drink lots of clear fluids (e.g., water, tea)",
            "This can be a Symptom of Cold or Flu Avoid drinking alcohol because it weakens your immune system and may interact with medications",
            "This can be a Symptom of Cold or Flu Eat a well-balanced diet, including fruits, vegetables, and grains"
        ]
      },
      {
        "tag": "conjunctivitis",
        "patterns": [
            " There is redness around my eyes", 
            " my eyes are itching",
            " tearing",
            " i am feeling burning sensation in my eyes"
        ],
        "responses": [
            "This can be a Symptom of conjunctivitis  Wash your hands frequently to prevent spreading an existing infection to your other eye, and to other people.",
            "This can be a Symptom of  conjunctivitis Dont rub your eyes.",
            "This can be a Symptom of conjunctivitis  Use a cool wet washcloth to soak off any crusting.",
            "This can be a Symptom of  conjunctivitis Use a warm or cool compress to reduce discomfort.",
            "This can be a Symptom of  conjunctivitis Discard eye make-up because it may cause future infection.",
            "This can be a Symptom of  conjunctivitis Wash any clothing that may be contaminated, including towels and pillowcases. Try to use clean towels and pillowcases everyday.",
            "This can be a Symptom of  conjunctivitis Avoid wearing contact lenses and discard current lenses.",
            "This can be a Symptom of  conjunctivitis If eye drops are prescribed, place drop in pocket formed by pulling down lower lid. Make sure you don't touch the bottle to the eye in order to prevent contamination.",
            "This can be a Symptom of  conjunctivitis If the infection does not improve in 2 or 3 days, make an appointment for re-evaluation."
        ]
      },
      {
        "tag": "headaches",
        "patterns": [
            "pain in my head",
            "i am having a headache",
            "i have headache",
            "pain in the right side of my Brain",
            "pain in the left side of my head",
            " feel nauseous",
            " feel vomiting"
        ],
        "responses": [
            "This can be a Symptom of headaches Ice pack held over the eyes or forehead",
            "This can be a Symptom of headaches Heating pad set on low or hot shower to relax tense neck and shoulder muscles",
            "This can be a Symptom of headaches Sleep, or at least resting in a dark room",
            "This can be a Symptom of headaches Taking breaks from stressful situations",
           " This can be a Symptom of headaches Regular exercise to increase endorphin levels and relax muscles. Even if you already have a headache, exercising may relieve the pain. However, intense exercise may bring on a headache.",
            "This can be a Symptom of headaches Occasional use of over-the-counter medicines such as acetaminophen, ibuprofen, or aspirin can relieve both migraine and tension headaches.",
            "This can be a Symptom of headaches Prescription drugs for severe headaches"
        ]
      }
    ]
  }
  
